<?php

require_once __DIR__ . '/../vendor/autoload.php';

(new Laravel\Lumen\Bootstrap\LoadEnvironmentVariables(
    dirname(__DIR__)
))->bootstrap();

date_default_timezone_set(env('APP_TIMEZONE', 'Asia/Almaty'));

/*
|--------------------------------------------------------------------------
| Создание приложения
|--------------------------------------------------------------------------
|
| Загружаем среду и создаём экземпляр приложения,
| который служит центральной частью структуры сервиса.
|
*/
$app = new Laravel\Lumen\Application(
    dirname(__DIR__)
);

/*
|--------------------------------------------------------------------------
| Регистрация фасадов
|--------------------------------------------------------------------------
|
| Фасады в сервисе используются для доступа
| к конструктору запросов (Query Builder) и ORM Eloquent
|
*/
$app->withFacades();
$app->withEloquent();

/*
|--------------------------------------------------------------------------
| Регистрирация контейнеров
|--------------------------------------------------------------------------
|
| Контейнеры в сервисе используются для обработки исключений
| и консольных команд artisan
|
*/
$app->singleton(
    Illuminate\Contracts\Debug\ExceptionHandler::class,
    App\Exceptions\Handler::class
);

$app->singleton(
    Illuminate\Contracts\Console\Kernel::class,
    App\Console\Kernel::class
);

/*
|--------------------------------------------------------------------------
| Регистрирация Redis
|--------------------------------------------------------------------------
|
| Redis служит для кэширования push-токенов сервиса
|
*/
$app->register(Illuminate\Redis\RedisServiceProvider::class);

/*
|--------------------------------------------------------------------------
| Регистрирация конфигурации
|--------------------------------------------------------------------------
|
| Загружаются и устанавливаются конфигурации сервиса
|
*/
$app->configure('app');

/*
|--------------------------------------------------------------------------
| Регистрирация роутера
|--------------------------------------------------------------------------
|
| Загружаем маршрутизацию в сервис
|
*/
$app->router->group([
    'namespace' => 'App\Http\Controllers',
], function ($router) {
    require __DIR__ . '/../routes/api.php';
});

return $app;
